[
  {
    "path": "posts/2021-07-13-assignment-1/",
    "title": "Assignment 1",
    "description": "VAST Challenge 2021",
    "author": [
      {
        "name": "Davmes Tan",
        "url": "https://www.linkedin.com/in/davmestan/"
      }
    ],
    "date": "2021-07-13",
    "categories": [],
    "contents": "\r\n1. Background\r\n1.1 Background Context\r\nExtracted from VAST Challenge 2021 here\r\nIn the roughly twenty years that Tethys-based GAStech has been operating a natural gas production site in the island country of Kronos, it has produced remarkable profits and developed strong relationships with the government of Kronos. However, GAStech has not been as successful in demonstrating environmental stewardship.\r\nIn January, 2014, the leaders of GAStech are celebrating their new-found fortune as a result of the initial public offering of their very successful company. In the midst of this celebration, several employees of GAStech go missing. An organization known as the Protectors of Kronos (POK) is suspected in the disappearance, but things may not be what they seem.\r\n1.2 The Challenge\r\nExtracted from VAST Challenge 2021 Mini Challenge 2 here.\r\nMany of the Abila, Kronos-based employees of GAStech have company cars which are approved for both personal and business use. Those who do not have company cars have the ability to check out company trucks for business use, but these trucks cannot be used for personal business.\r\nEmployees with company cars are happy to have these vehicles, because the company cars are generally much higher quality than the cars they would be able to afford otherwise. However, GAStech does not trust their employees. Without the employees’ knowledge, GAStech has installed geospatial tracking software in the company vehicles. The vehicles are tracked periodically as long as they are moving.\r\nThis vehicle tracking data has been made available to law enforcement to support their investigation. Unfortunately, data is not available for the day the GAStech employees went missing. Data is only available for the two weeks prior to the disappearance.\r\nTo promote local businesses, Kronos based companies provide a Kronos Kares benefit card to GASTech employees giving them discounts and rewards in exchange for collecting information about their credit card purchases and preferences as recorded on loyalty cards. This data has been made available to investigators in the hopes that it can help resolve the situation. However, Kronos Kares does not collect personal information beyond purchases.\r\nThe objective of this assignment is to assist law enforcement authorities to ascertain varying purchases made by specific GASTech employees and to identify suspicious patterns of behaviour.\r\n2. Data Preparation\r\nThere are a total of 3 csv files provided for MC 2. They are:\r\ncc_data.csv\r\nloyalty_data.csv\r\ngps.csv\r\nThere were a few issues that was needed to be resolved in both csv files.\r\nThere is a need to convert the timestamp of all files into a dttm format\r\nFor cc_data.csv and loyalty_data.csv there are unrecognised characters within the location variable. Thus, I would convert it into a UTF-8 readable format.\r\n3. Question 1 - Analysing Credit Card and Loyalty Card Data\r\n3.1 Popular Locations during the Weekdays\r\n\r\n\r\n\r\n\r\n\r\n\r\nFrom the heat map visualisation, it can be observed that the following locations are largely popular during weekdays.\r\nAbila Zacharo\r\nBrew’ve Been Served\r\nGelatogalore\r\nGuy’s Gyros\r\nHallowed Grounds\r\nHippokampos\r\nKatrina’s Cafe\r\nOuzeri Elian\r\nSimilar observations were seen on both set of data in credit card and loyalty card transactions.\r\n\r\n\r\n\r\n\r\n\r\n\r\n3.2 Popular Locations during the Weekends\r\nDuring weekends, the the popular locations are:\r\nGuy’s Gyros\r\nHippokampos\r\nKalami Kafenion\r\nKatrina’s Cafe\r\nOuzeri Elian\r\nSimilarly, observations were consistent on both set of data in credit card and loyalty card transactions.\r\n3.3 Periods of high transactional volume at popular locations\r\nTo discover the popular periods for the locations, we could only use credit card transactions, since the timestap has a time element to it. This is what we discovered:\r\n\r\n\r\n\r\n\r\n\r\n\r\n3.4 Anomalies in the data\r\nIt was noticed that there are 34 distinct locations in the credit card transactions and 33 distinct locations in the loyalty card transactions. A quick comparison was made, and it was noticed that Daily Dealz was not inside the loyalty card transaction. An inference could be that the location does not provide any benefits for the usage of GASTech loyalty card.\r\n4. Adding vehicle data analysis into the data\r\nWith the gps data, which comes with 5-decimal points for the lat/long co-ordinates, I attempted to round it off to 4 decimal points, to get an accuracy of only 11.1metres, so that I could do a count on popular co-ordinates that was frequented. After examining the extracted data, I have decided to plot the map for those coordinates that have 50 counts and above and 100 counts and above.\r\n\r\n\r\n5. Inferring Owners of Each Credit Card with Loyalty Card\r\nThe above table would be able to infer the credit card holder to the specific loyalty card number. However, there were uncertainties in the data. For instance, credit card transactions timestamp were indicated with date and time while loyalty card transactions were indicated with date only. There may be occasions where the date, price and location may match between both sets of data but they were different transactions for the day.\r\nThe transactions involved are:\r\n9 Jan 2014, Katrina’s Café transaction amount of $26.60\r\n9 Jan 2014, Guy’s Gyros transaction amount of $8.23\r\n11 Jan 2014, Hippokampos transaction amount of $63.21\r\n\r\n\r\nThere were 2 transactions at each location bearing the same price at the same date inside loyalty data. However, we were unsure which transaction from each dataset belongs to which. And therefore, these observations would be excluded.\r\nIt was observed that:\r\n1286 credit card holder uses 2 loyalty cards that is L3288 and L3572\r\nL6267 loyalty card holder uses 2 credit cards that is 6691 and 6899\r\nWe can see that owner of 1286 used two different loyalty cards at various instances.\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-07-13-assignment-1/assignment-1_files/figure-html5/Plot 3-1.png",
    "last_modified": "2021-07-18T18:03:31+08:00",
    "input_file": "assignment-1.knit.md"
  },
  {
    "path": "posts/2021-06-13-dataviz-makeover-2/",
    "title": "DataViz Makeover 2",
    "description": "Singapore's Top 10 Trading Partners for Import and Export Markets between 2011 and 2020",
    "author": [
      {
        "name": "Davmes Tan",
        "url": "https://www.linkedin.com/in/davmestan/"
      }
    ],
    "date": "2021-06-13",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Introduction\r\n2. Visualisation Critiques\r\n2.1 Clarity\r\n2.1.1 Contradicting Numbers regarding Net Trading Markets\r\n2.1.2 Missing Title, Objective and Period of Measure\r\n2.1.3 Unknown Selection Criteria for Trading Countries/ Markets\r\n2.1.4 Net Importers/ Exporters\r\n\r\n2.2 Aesthestics\r\n2.2.1 Incorrect Placement of Imports/Exports Icon\r\n2.2.2 Inconsistent Placement and Overlapping of Tooltip Info\r\n2.2.3 Graph Layout\r\n\r\n\r\n3. Proposing an Improved Visualisation\r\n4. The Improved Visualisation\r\n5. Step-by-Step Description on how the Improved Visualisation was prepared\r\n5.1 Data Preparation\r\n5.1.1 Getting Started with Tableau Prep Builder\r\n5.1.2 Cleaning T1 and T2\r\n5.1.3 Creating Union between T1 and T2\r\n5.1.4 Removing Repeated Columns\r\n5.1.5 Saving the Cleaned Data into a new Worksheet\r\n\r\n5.2 Building the Visualisation\r\n5.2.1 Creating Calculated Fields\r\n5.2.2 Creating Top 10 Importers Chart\r\n5.2.3 Bubble Plot for Net Trade\r\n5.2.4 Creating a new Dashboard\r\n\r\n\r\n6. New Insights from the Improved Visualisation\r\n\r\n1. Introduction\r\nMerchandise Trade data collated by the Department of Statistics Singapore, comprising of total imports/ exports since January 1976, is published on here. The data is segregated into various regions and countries. We were given a set of visualisation, based on the data, and was tasked to provide critiques and to further suggest how to better improve the visualisation. The original visualisation is represented below:\r\n\r\n2. Visualisation Critiques\r\n2.1 Clarity\r\n2.1.1 Contradicting Numbers regarding Net Trading Markets\r\nHong Kong was indicated as Singapore’s Top Exporter while Taiwan was indicated as Singapore’s Top Importer at $69Bn and $75.2Bn respectively. However, many other countries/ regions were listed with higher numbers such as $102.4Bn (United States), $90.1 Bn (EU), $103.5 mil (Malaysia) and $136.2Bn (China). This create a confusion for the readers to evaluate whether Hong Kong/ Taiwan were the top exporter/importer markets while other countries/ region having a seemingly larger numbers may suggest a higher net trade balances. What is missing from the graph, is the net trade balances of the respective markets. By indicating the net trade balances from the markets, it would present a more convincing picture.\r\n2.1.2 Missing Title, Objective and Period of Measure\r\nWhile the graph bears a central theme towards a Net Importer and Net Exporter country, it failed to suggest the period of measure. In one of its caption, the focus was on Mainland China in 2009 while the other was on US in 2006. The reader would not be able determine the period of measure for this visualisation and the additional caption, without context, would further confuse the readers.\r\n2.1.3 Unknown Selection Criteria for Trading Countries/ Markets\r\nThe graph listed the trading information of 10 countries/ region/ markets. There were no mentioning of the selection criteria of the 10 trading markets. While some are countries, it included a EU region, comprising of several EU nations. Therefore, it may baffle the readers on the comparison factors/ considerations into selecting the trading markets in the graph.\r\n2.1.4 Net Importers/ Exporters\r\nAt the bottom right of the graph, a label suggesting “Net Exporters” and at the top left of the graph, a label suggesting “Net Importers” were not clear in its purposes. While it may refer to the net import/export from the respective trade markets, it was not indicative of the period of measure for this summation. There is no indication of the date duration for this summation.\r\n2.2 Aesthestics\r\n2.2.1 Incorrect Placement of Imports/Exports Icon\r\nFrom the graph, it was assumed that the x-axis referred to the total exports to the trade markets, while the y-axis represented the total imports from the trade markets. While the colour sequence of the imports (blue) and exports (green), matched the scale and area, the placement of imports and exports icon at the beginning of x-y scale could be better. While the respective icons was meant to indicate the line of scale - blue scale represented by imports (thus being placed at the start of the line), and green scale represented by exports (thus being placed at the start of the line), intuitively, that is not how a reader may interpret the labels.\r\n2.2.2 Inconsistent Placement and Overlapping of Tooltip Info\r\nThe graph attempted to annotate the details of the trade markets’ total trade volume. However, it is contradiction with the concluding information, which was supposed to suggest net trade volume. The annotation was also in the way of the trade market’s bubble, thus making the reading of the graph difficult. In addition, the center white circle, that was supposed to represent the net trade balance, was not visible on some of the trade markets’ bubbles.\r\n2.2.3 Graph Layout\r\nThe graph had four components: (a) the visualisation graph; (b) definition of the graph; (c) legend; and (d) insight. While all four components were suggesting along the same topic on net trade surplus/deficit, the placement of the components and the visualisation of the graph was not intuitive for readers. For instance, the size of the bubble were premised on the net trade volume(summation of imports and exports). The legend was focusing on the net importer and exporter while the insights were referencing US and Mainland China. Therefore, the layout of the graph would need to be consistent and intuitive, so that the readers is able to understand the infographics intuitively, without much processing and cross-referencing.\r\n3. Proposing an Improved Visualisation\r\nWith the above critiques, I would be suggesting an alternate graphical presentation to better present the data to a wider audience. The proposed layout of the improved visualisation is as stated below:\r\n\r\n4. The Improved Visualisation\r\nThe improved visualisation would address all the critiques that were mentioned above. In addition, we would maintain the existing bubble plot, with the added enhancements:\r\nThe reader would be able to select the year of trade.\r\nThe size of the bubble will correspond with the trade market’s net trade volume. For instance, if the trade market is a net importer, the net trade volume would reflect the net import value.\r\nA dynamic tooltip would provide additional information of the selected trade market. It would display:\r\nTrade Year\r\nTrade Market\r\nNet Trade Volume\r\nPast Trade information from 2011 to 2020\r\n\r\nThe Top 10 Importers and Exporters would be display, to allow readers to how the trade markets had evolved over the years.\r\n5. Step-by-Step Description on how the Improved Visualisation was prepared\r\n5.1 Data Preparation\r\n5.1.1 Getting Started with Tableau Prep Builder\r\nWe could use Tableau Prep Builder to prepare and to clean the data. Do the following steps:\r\nOpen the Excel file \r\nCheck on “Use Data Interpreter” to allow Tableau to best-interpret the excel worksheets. \r\nDouble click on T1 and T2, to load both worksheets. The final screen should look like this: \r\n5.1.2 Cleaning T1 and T2\r\nWe will now commence to clean T1. Click on “View and clean data”:  Since we are looking at data from Jan 2011, we will proceed to delete all columns before Jan 2011. To do that, click on the column at “1976 Jan” and Shift+click “2010 Dec”. This will select all the columns. Right click on any of the selected columns, and click on remove. Do the same for Jan 2021 to Apr 2021.  There is a need to pivot the table, such that the columns are now referred to as rows. To do that, select all the columns, less “Variables”. Right click on any of the selected column and choose “Pivot Columns to Rows”  Inside the worksheet, there is a row that indicates the Total Merchandise Imports. Similarly, there are collated information based on regional imports. To avoid repetitions but to keep regional information (Africa, Asia, Americas etc), choose “Total Merchandise Imports” and click on “exclude”.  The trading markets are currently listed with unnecessary information such as, “Thousand Dollars”. To remove them, we could use Tableau Automatic Split function to trim the data. Right click on “Variables” and then choose “Split Values” -> “Automatic Split”  With there, there is a series of adjustments that we need to make for T1:\r\nRename “Variables - Split 1” to “Import Market”\r\nRemove “Variables - Split 2” column\r\nRename Pivot1 Names to “Import Month”\r\nChange the format of Import Month from “String” to “Date”\r\nRename Pivot1 Values to “Import Value”\r\nRemove “Variables” column\r\n\r\nThe final table for T1 should look like this:\r\n\r\nWe will proceed to do similar steps for T2.\r\nThe final screen should look like this:\r\n\r\n5.1.3 Creating Union between T1 and T2\r\nThere is a need to create a union between T1 and T2. To do this, drag T1 Pivot into T2 Pivot and ensure that the word “join” is highlighted.\r\n\r\nNext, go to Settings, and join the following fields together:\r\nExport Market = Import Market\r\nExport Month = Import Month\r\n\r\n5.1.4 Removing Repeated Columns\r\nSince Imported Market and Exported Market, and Imported Month and Exported Month are the same, we would delete one of the column, and rename them instead.\r\nRename Import Month to Month\r\nRename Import Market to Market\r\nRemove Export Month\r\nRemove Export Market\r\n5.1.5 Saving the Cleaned Data into a new Worksheet\r\nOnce the join is complete, we can export the file into Excel, to be used in Tableau. To do so, click on the ‘plus’ sign and choose Output.\r\n\r\nTo create an output to Excel, do the following under the settings pane:\r\nEnsure \"Microsoft Excel (.xlsx) is selected\r\nBrowse and locate the original Excel file\r\nType “prep” and click on “Create new worksheet”Prep\"\r\nOnce that is done, click on “Run Flow”\r\n\r\nNow, a new worksheet has been created inside the original Excel file. We can proceed to use the worksheet to create the Visualisation inside Tableau.\r\n5.2 Building the Visualisation\r\n5.2.1 Creating Calculated Fields\r\nThere is a need to create various calculated fields, so that we could calculated the following:\r\nTotal Trade Volume\r\nTop Importer\r\nTop Exporter\r\nNet Trade\r\nTo do so, go to the Data Pane, click on the down arrow and choose “Create Calculated Field” \r\nCreating Total Trade Calculated Field\r\n\r\nCreating Top Importers Calculated Field\r\n\r\nCreating Top Exporters Calculated Field\r\n\r\nCreating Absolute Net Trade Calculated Field\r\n\r\n5.2.2 Creating Top 10 Importers Chart\r\nTo create a graph plot, to list the top 10 Importers, we can do the following:\r\nDrag Top Importer into the Rows\r\nDrag Market into the Columns\r\nDrag Market into the Color\r\nDrag Market into the Filters\r\nRight click on Filters -> Market and choose Edit Filter\r\n\r\nGo to Top Tab\r\nChoose By Field\r\nAdjust the filter to select the Top 10 Importers\r\n\r\nNext we will go to the Rows, select Market and then click on Sort\r\n\r\nAdjust the following parameters:\r\nSort By: Field\r\nSort Order: Ascending\r\nField Name: Top Importer\r\nAggregation: Sum\r\n\r\nAfter the adjustments, the chart should look something like this:\r\n\r\n5.2.2.1 Aesthetics\r\nWe would proceed to improve the aesthetics of this chart. First, we can add the Net Import Value into the graph. To do so, we could do the following:\r\nDrag Importer into Label\r\nRight-Click on SUM(Top Importer) and click on Format\r\nUnder Format, adjust the following parameters:\r\nUnder Font, choose size 10 and Bold\r\n\r\nUnder Alignment; (1) Horizontal-Centre; (2) Direction-Up; (3) Vertical-Top; and (4) Wrap-Automatic\r\n\r\nUnder Numbers: (1) Numbers (Custom); (2) Decimal-0; (3) Display Units-Million (M); and Prefix-SGD\r\n\r\nThe chart would then show the Top 10 Net Importers into Singapore, cumulated between 2011 and 2020, with Italy at the 10th spot. There is a need to know the total net import amount, as this would aid in subsequent building of the charts. To find out the total net import amount from the 10th trading market, right-click on Italy and click on View Data. The total net import value for Italy (10th Net Importer) is 41,314,586\r\n\r\nNext, we would add the Year Filter into the chart. To do so:\r\nDrag Month into Filters\r\nSelect Years and click Next; Choose all the values listed inside\r\n\r\nRight-click on the dimension and click Show Filter\r\n\r\nRight-click on the down-arrow at the filter and click Single Value (list)\r\n\r\nTo allow readers to compare values between years, we will remove the (All) option. To do this, right-click on the down-arrow, select Customised and uncheck the Show “All” Value\r\n\r\n5.2.2.2 Making Minor Adjustments\r\nAdjustments of Trade Market Names\r\nFor some trade markets, they may be too long, for properly alignment subsequently. Therefore, we will adjust the following market names:\r\nUnited States to US\r\nUnited Arab Emirates to UAE\r\nGermany, Federal Republic to Germany\r\nTo do so, go to the name of the trade market, right-click and choose Edit Alias\r\n\r\n5.2.2.3 Creating Top 10 Exporter Chart\r\nWith similar concepts from the creation of Top 10 Importer Chart, we can proceed to do a new Top 10 Exporter Chart. However do that:\r\nInstead of Sorting it in Ascending Order, Sort it in Desecnding Order with the field Top Exporter.\r\n5.2.3 Bubble Plot for Net Trade\r\nTo create the Net Trade Bubble Plot, we would do the following:\r\nDrag the Import Value to Rows\r\nDrag the Export Value to Columns\r\nDrag the Market to Color\r\nGo to Condition, choose By Formula and type the following:\r\nSUM([Top Importer]) >= 41314586 OR SUM([Top Exporter]) >= 41499315 this will tell Tableau that we are keen to select the Top 10 Importers and the Top 10 Exporters \r\n\r\nDrag Net Trade to Size\r\nDrag Month to Filter, choose Year and click Next, and Select all Values available.\r\nSimilarly, click on the Year(Month) down-arrow and click Show Filter\r\n\r\nSimilarly, change the filter to radio buttons and disable the Show “All” Values\r\nThe initial visualisation should look like this:\r\n\r\n5.2.3.1 Adding a Diagonal Reference Line\r\nFor the Net Trade Bubble Chart, it would be useful to add a diagonal line, such the anything towards the left of the line would suggest that it is an Market Importer while anything that is towards the right of the line would suggest that it is an Market Exporter\r\nSince Tableau does not have a function to add a diagonal reference line, we would attempt to use Trending LIne to server as a reference line. To do that, we would do the following:\r\nGo to Analysis and then switch off Aggregate Measures. This will allow Tableau to show all data points, instead of aggregating them.\r\nCreate a Calculated Field and rename it as Diagonal Reference Line. Inside the field, add [Export Values] into it.\r\nDrag Market into Detail and Import Value into Color\r\nDrag DIagonal Reference Line into Rows, placing it next to Import Value\r\n\r\nClick Diagonal Reference Line and click on Dual Axis\r\n\r\nRight-Click on Diagonal Reference Line Axis and choose Synchronise Axis\r\n\r\nGo to SUM(Diagonal Reference Line) pane, click on Automatic and change to Line\r\nGo to one of the lower point, along the plot, right-click, and go to Trend Lines, Show Trend Lines\r\n\r\nClick on Color and reduce the opacity to 0%.\r\nRight click on the Diagonal Reference Line axis and switch off Show Header\r\nClick on the Trend Line, and click Edit\r\nUncheck on the box Show tooltips\r\n\r\nSynchronise both axes by providing fixed ranges\r\nFixed Start: -5000000\r\nFixed End: 75000000\r\n\r\nGo to SUM(Import Value) pane, remove SUM(Import Value) from Color and replace it with Market\r\nGo to Analysis and switch on Aggregated Measures again. The final screen should look like this.\r\n\r\n5.2.3.2 Improving the Aesthesics of Net Trade Bubble Chart\r\nA couple of things could be adjusted to make the Bubble Chart more readable and intuitive.\r\nChange the Automatic parameter to a Circle parameter\r\nAdjust the size of the circle to about 75%\r\nAdding Market into the labelling, and adjust the labelling to be on top of the bubble\r\n5.2.3.3 Adding Flags to be used as Bubble Chart\r\nTo add flags to be presented onto the Bubble Chart, there is a need to download and create a repository for the flags. To download the flags, we could go to Flaticon. After which, go to Tableau default folder and create a Flags folder. This folder would be used to save all the flags.\r\n\r\nNext, do the following:\r\nChange from the existing Circles to Shapes\r\nDrag Market into Shape\r\nRight-Click on the Market Legend and choose Edit Shapes\r\n\r\nClick on Reload Shapes\r\n\r\nWe should see the Flags category, and assign the flags accordingly.\r\n\r\nThe final product should look like this:\r\n\r\n5.2.3.4 Enhancing Bubble Plot Tooltip\r\nWe would attempt to include an Import and Export graph, over the past 10 years, to allow users to view the historical data. To do that:\r\nCreate a new worksheet and name it as Import and Export.\r\nDrag Month to Columns and choose Year\r\nDrag Import Value to Rows and Export Value to the right of the graph.\r\nThe graph should look likle this:\r\n\r\nSynchronise both axes\r\n\r\nResize the chart, and ensure the axes colours are themed in accordance to the colour of the line. The size of the chat should look like this:\r\n\r\nGo back to Net Trade worksheet and adjust the tooltip by clicking Insert -> Sheets -> Import and Export. Adjust the maxwidth to 500.\r\n\r\nThe final tooltip should look this:\r\n\r\n5.2.4 Creating a new Dashboard\r\nBefore the dragging of any worksheets into the dashboard, it is important to ensure that the size of the dashboard is set to automatic. To create an interactive dashboard, we would drag the following 3 worksheets into the dashboard\"\r\nTop 10 Importer\r\nTop 10 Exporter\r\nNet Trade\r\nCreate a new title and label it as Singapore’s Trading Partners (Import/ Export) for 2011 to 2020.\r\nTo allow the respective market to be highlighted, when any trade market is selected at the Bubble Plot, do the following:\r\nGo to Dashboard and click on Actions\r\n\r\nClick on Add Action and choose Highlight\r\n\r\nKey in the following:\r\nClick on Select\r\nUnder Source Sheets, select Net Trade only\r\nUnder Target Sheets, select Top 10 Exporter and Top 10 Importer\r\n\r\n\r\nNow, whenever any trade market is selected on the Bubble Chart, the respective Import/Export chart would be highlighted, with the selected market.\r\nAdding Animation\r\nSince the reader is able to select between the year of data, it would be useful to add animation to allow the reader to visualise the changes over the years. To do so:\r\nGo to Format -> Animations\r\nSwitch it On and set duration 1.00 seconds (Flow)\r\n\r\nThe final dashboard would look like this:\r\n\r\nThe interactive version could be found here\r\n6. New Insights from the Improved Visualisation\r\nUS, from a Net Importer, into a Net Exporter\r\nIn 2011, Saudi Arabia was Singapore’s joint Top Importer with US, having a net import trade of about SGD 21 million. However, from 2018 onwards, US commenced on a downward decline and in 2020, US, from being our Top Net Importer between 2011 and 2017, became our Net Exporter, having a trade surplus of SGD 6 million. A possible explanation for this was that Donald Trump was elected as the President of the United States in 2017, with the inauguration on Jan 2018. He then went on to implement a series of trade barriers and having the trade war intensifying between US and China, it may have affect the market between Singapore and US.\r\nTrade Deficit with Hong Kong for the past 10 years\r\nFor the past 10 years, Singapore has a trade deficit with Hong Kong in the ranges of SGD 50 million per year. That means that Singapore had exported out much more merchandise to Hong Kong, than we import from them. Transshipment between countries, transiting at Hong Kong, could be a reason for the constant high trade deficit, since the population of Hong Kong is not that big to be consuming so much merchandises.\r\nMalaysia, from a Net Exporter, into a Net Importer\r\nSince 2011, Malaysia had been Singapore’s Net Exporter. However, from 2019, our exports to Malaysia started to dip, with the sharpest decline in 2020. That could be attributed to Covid-19 where Malaysia imposed a series of control order such as Movement Control Order (MCO), COnditional Movement Control Order and Recovery COntrol Order. The trade routes between Singapore and Malaysia premised on the 2 causeways between both countries. Therefore, with a series of control order in Malaysia, the export value dropped tremendously in 2020, resulting in an overall trade deficit of SGD 11 million.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-07-13T14:06:53+08:00",
    "input_file": "dataviz-makeover-2.knit.md"
  },
  {
    "path": "posts/2021-05-27-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "Top 6 countries based on total combined Merchandise Trade Imports/ Exports value between 2019 and 2020",
    "author": [
      {
        "name": "Davmes Tan",
        "url": "https://www.linkedin.com/in/davmestan/"
      }
    ],
    "date": "2021-05-27",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Introduction\r\n2. Visualisation Critiques\r\n2.1 Clarity\r\n2.2 Aesthestics\r\n\r\n3. Proposing an Improved Visualisation\r\n4. The Improved Visualisation\r\n5. Step-by-Step Description on how the Improved Visualisation was prepared\r\n5.1 Data Preparation\r\n5.2 Exploratory Data Analysis\r\n5.3 Creating An Overall Trade (2019 to 2020) Graph for Top Six Countries\r\n5.4 Import and Export Graph\r\n5.5 Creating a Visualisation Dashboard\r\n\r\n6. New Insights from the Improved Visualisation\r\n6.1 China - Singapore’s Top Importer and Exporter Country\r\n6.2 Hong Kong - Low Import Value, High Export Value\r\n6.3 China’s Total Trade with Singapore = Hong Kong’s Total Trade + Taiwan’s Total Trade\r\n\r\n\r\n1. Introduction\r\nMerchandise Trade data collated by the Department of Statistics Singapore, comprising of total imports/ exports since January 1976, is published on here. The data is segregated into various regions and countries. We were given a graph depicting the merchandise trade imports/exports for six countries over 2019 and 2020.\r\n\r\nFigure 1: Original Visualisation depicting trades of six countries from 2019 - 2020\r\n2. Visualisation Critiques\r\n2.1 Clarity\r\n2.1.1 No Clarity in Title\r\nThe title suggested Merchandise Trading of Top Six Trading Countries, 2019 - 2020. However, it was not clear in suggesting how the six countries were accounted for, as top six trading countries. For a layman, the ambiguity could suggest that the countries could be defined as top six trading countries by total import/export trading volume, total import/export trading value, total import volume/ value, total export volume/ value etc.\r\n2.1.2 No Clarity on Period of Measure\r\nThe title suggested a period of measure, 2019 - 2020. However, under the period scale (x-axis) for the countries, month of period (2019 to 2021), less Japan, was shown. While the title suggested month of period, no indications of months were provided.\r\n2.1.3 Incomplete Data Visualisation for Japan\r\nThe title suggested that the data would comprise of data from 2019 to 2020. However, under the chart depicting Japan, only “2020” was shown at Month of Period.\r\n2.2 Aesthestics\r\n2.2.1 Incorrect Usage of Graphs\r\nThe graphs attempted to use an area graph to depict the import and export values of the respective countries. Such area graph is suitable to depict profit over revenue, when we need visualisation to suggest when would the revenue turn profitable. In addition, profit is a result from revenue, after taking into account other costs and expenses. However, imports and exports are not a result from either one another. Therefore, such a graph is not suitable to depict the import/export value.\r\n2.2.2 Unsuitable Usage of Colours\r\nThe graphs attempted to use 2 colours to differentiate between import and export value. However, using an incorrect graph will see the value of imports and exports being overlaid with each other, forming a different shade of colour. Although only two colours were used, a third shade of colour appeared, thus creating confusion for readers.\r\n2.2.3 Inept for Intuitive Comparison Among Countries\r\nThe graphs are separated into six different charts and it does not allow the users to intuitively compare the import/export values among the countries. In addition, the reader is unable to comprehend the the pegging order of the six countries, in terms of the total value of import and export for the period 2019 to 2020.\r\n2.2.4 Inconsistent Intervals across and within Charts\r\nAt first glance, the six different charts may suggest that the six countries are having similar trade value from 2019 - 2020. However, upon closer examination, the charts do not have a consistent intervals for the Export value. Similarly, a quick glance may suggest that trade value between imports and exports seem to differ slightly. But it was attributed to different interval scales within the chart itself. Such inconsistencies would not allow the reader to pick up the correct information, and worse, misled the readers.\r\n2.2.5 Missing Intervals to Indicate Month of Period\r\nThe x-axis of the graphs was labelled as \"Month of Period. However, there are no interval ticks to suggest to indicate the various months.\r\n3. Proposing an Improved Visualisation\r\nWith the above critiques, I would be suggesting an alternate graphical presentation to better present the data to a wider audience. The proposed layout of the improved visualisation is as stated below:\r\n The improved visualisation would achieve the following:\r\n4. The Improved Visualisation\r\nThe improved visualisation would address all the critiques and provide visual enhancements. The improvements include:\r\nProviding clarity in the title heading, to suggest that the top size countries were chosen based on total trade value, imports and exports, from 2019 to 2020. This is further enhanced by sorting the countries by their trade value.\r\nProviding interval marks for months of period from 2019 to 2020, to allow reader to have an indication the trade value (import/export) for the particular month made by a specific country.\r\nEnsuring all six countries depicts the trade value from 2019 to 2020.\r\nProviding 3 separate charts to allow reader to visualise the data better:\r\nChart 1: Using horizontal bar chart to displaying the total trade value (imports and exports) from 2019 to 2020, sorted in descending order for trade value.\r\nChart 2: Using line graph to depict the import value of various countries, differntiated by varying colours, from 2019 to 2020.\r\nChart 3: Using line graph to depict the export value of various countries, differntiated by varying colours, from 2019 to 2020.\r\n\r\nThe import and export chart would use consistent intervals at the y-axis across both charts, so as to allow the reader to:\r\nIntuitively compare the trade value among the six countries.\r\nIntuitively compare the import and export value of the same country.\r\nIntuitively rank the countries in accordance to trade value, import value and export value, separately.\r\n\r\n\r\n5. Step-by-Step Description on how the Improved Visualisation was prepared\r\n5.1 Data Preparation\r\n5.1.1 Using Tableau Data Interpreter\r\n\r\nTableau Data Interpreter will attempt to identify the structure of the Excel file and convert it into a suitable format for Tableau processing. There are 3 worksheets inside the Excel file, Content, T1 and T2. For thise exercise, we will be using T1 and T2.\r\n5.1.2 Preparing T1 and T2\r\nUpon examining T1, it was observed that it contains all the Merchandise Trading Imports from various countries and regions from Jan 1976. However, the data is organised such that every observations (rows) represents the trade value of a specific country/ region from Jan 1976. This would not be suitable for our analysis. Therefore, there is a need to pivot the data such that we have two variables, Month of Trade and Value. To pivot the table:\r\nSelect all observations, less Variables\r\nRight-click and select Pivot\r\n\r\n5.1.3 Adjust Variable Names and Types\r\nMonth of Period\r\nWhile the Month of Period of import is recorded as Month (MMM) and Year (YYYY), Tableau identified it as a string format. Therefore, there is a need to adjust it into a Date format. To do this:\r\nClick on the Abc\r\nClick on Date\r\n * Rename the Dimension as Month (Import)\r\nRename Variables\r\nThe countries/ regions are described as Variables. To rename:\r\nClick on the Column\r\nRight-Click and choose Rename\r\nTYpe Country (Import)\r\n\r\nCreating Calculated Field\r\nThe Merchandise Trading Value are depicted in Thousands of Dollars (’000). To depict the exact value for computation and display, we need to create a calculated field. To do this:\r\nHover the cursor to the down-arrow at the column variable\r\nClick on Create Calculated Field\r\nName it as Import Value\r\nUnder the input box, type [Pivot Field Values] * 1000\r\nClick on OK\r\n\r\nA new column, Import Value would be created, with the adjusted value.\r\n\r\nNow that the Data Preparation for T1 is completed, proceed to do the same for T2 that accounts for the Merchandise Trading Export Value.\r\nEstablishing Table Relationships\r\nThere is a need to build the relationship model between both tables. To do so:\r\nDrag T1 and T2 into top window pane\r\nClick on the link, connecting between T1 and T2\r\nLink Country (Import) with Country (Export)\r\nLink Month (Import) with Month (Export)\r\n\r\n5.2 Exploratory Data Analysis\r\nThere is a need to examine the data, to determine whether the six countries, highlighted, are indeed the top six countries in terms of total Merchandise Trading Value for 2019 to 2020.\r\nCreate a new worksheet, naming it as Total 6 Countries, and create a new calculated field.\r\nUnder the Data Pane, click on the down arrow \r\nClick on Create Calculated Field\r\nType Total Import/Export Value for the Dimension Name\r\nUnder the input box, type [Import Value] + [Export Value] \r\nClick OK\r\nNow we are ready to create the first Data Visualisation Worksheet.\r\nWe need to narrow the data to contain only records from 2019 to 2020. We can use the filter option to achieve this. To do this:\r\nDrag the Month (Import) into the Filter Pane, and then choose Years and click Next. Select 2019 and 2020 and click OK.\r\n\r\nTo create the visualisation graph:\r\nDrag the Total Import/Export Value to Columns\r\nDrag the Country (Import) to Rows\r\nClick on Country (Import) down arrow and choose Sort\r\nUnder Sort By, choose Field\r\nUnder Sort Order, choose Descending\r\nUnder Field Name, choose Total Import/Export Value\r\n\r\n5.3 Creating An Overall Trade (2019 to 2020) Graph for Top Six Countries\r\n5.3.1 Filter Out all Countries, less the Top Six\r\nNow that we know that Malaysia, China, US, Taiwan, Japan and Hong Kong are our top six countries with the highest trade value (import and export) for 2019 and 2020, we will filter out all other countries. To do so:\r\nDrag the Country (Import) into the Filter pane\r\nClick on None to deselect all countries\r\nSearch for the six countries and manually check their boxes\r\nEnsure all 6 countries are selected\r\nClick OK\r\n\r\n5.3.2 Finalising Total Trade Value Graph\r\nSegregating 2019 from 2020\r\nInstead of displaying the total trade value from 2019 to 2020, it would be useful to split the data into 2019 and 2020. To do so:\r\nDrag the Month(Import) into the Color button\r\nA window would appear. Click on Add all members \r\nIncluding Labels\r\nIt would be useful to add data into the graph To do so:\r\nClick on Labels\r\nCheck on the box, Show mark labels\r\nSort the Year\r\nIntuitively, a reader would read from left to right. Therefore, it would be more intuitive to display 2019 data, followed by 2020 data, on the graph. To do so:\r\nClick on the down arrow at the legend\r\nUnder Sort Order, choose Descending \r\nEdit Title, Alias and Colours\r\nThere is a need to correctly label the title. To do so, double click on the Total 6 Countries and change it to Top Six Countries, based on Total Merchandise Import and Export Value for 2019 to 2020\r\nTo edit the Y-Axis labels:\r\nRight click on the label, and click on Edit Alias\r\nThere is a need to adjust the colours, such that it is of a lighter tone, since numerous set of colours would be used against a white backdrop. Lighter tone of colours would be pleasing to the readers’ eyes. To adjust the colours, go to the legend and select, Edit Colors.\r\n5.3.3 Graph 1: Top Six Countries, based on Total Merchandise Import and Export Value for 2019 to 2020\r\nThe final graph should look like this:\r\n\r\n5.4 Import and Export Graph\r\n5.4.1 Creating the Graphs\r\nTo create a new import graph, create a new Worksheet and rename it as Import. Using the steps described above, we would:\r\nFilter out all countries less the six countries\r\nSelect only 2019 and 2020 data\r\nDrag the Import Value to Rows\r\nDrag the Month (Import) to Columns. Click the down arrow and select the 2nd Month\r\n\r\nAdd the Country (Import) into Color\r\nThe graph should look like this:\r\n There is a need to adjust the aesthetics for the graph. The following would be done:\r\nAdjusting the Y-axis to allow both Import and Export to have the same scale.\r\nAdjusting the X-axis to orientate the label to be vertically aligned.\r\nAdjusting the intervals for X and Y-axis, to include appropriate major and minor ticks.\r\nAdjusting the legend to better reflect the countries.\r\nAdjusting the labels on X and Y-axis.\r\nDo the same for Export Worksheet. The final graphs for Import and Export should look like this:\r\n5.4.2 Total Import Value for the Top Six Countries\r\n\r\n5.4.3 Total Export Value for the Top Six Countries\r\n\r\n5.5 Creating a Visualisation Dashboard\r\n5.5.1 Setting the Initial Layout\r\nIn order to set the initial layout, do the following:\r\nDrag the Total 6 Countries to the upper half of the dashboard\r\nDrag the Import to the lower half of the dashboard\r\nDrag the Export to the lower half of the dashboard, keeping it aligned to the right of Import\r\nThe layout should look like this:\r\n\r\n5.5.2 Adjusting the Dashboard Layout\r\nSize Fitting for Top 6 Countries GRaph\r\nThe current layout requires the user to scroll the graph Since this is going to be a static visualisation and to avoid having the user to adjust the graph for better visualisation, we will size fit the graph accordingly. To do this:\r\nClick on the graph\r\nClick on the down arrow\r\nGo to Fit, then choose Fit Height\r\nThis will allow Tableau to fit the graph in accordance to the current height dimension.\r\n\r\nAdjust the legend for all Graphs\r\nSince both import/ export graphs bears the same colour representation for the countries, there is no need to have 2 legends. In addition, we can move the legend to the bottom of the dashboard. To do this:\r\nClick on one of the legend and click on the ‘X’ button to remove the legend\r\nDrag the remaining legend to the bottom of the page, and have it docked at the bottom.\r\nTo maximise the width space for the graph, we could relocate the legend for Top 6 Countries. To do so:\r\nClick on the legend for Top 6 Countries\r\nClick on the down arrow\r\nClick on Floating\r\n\r\nAdjust the legend to ‘float’ just above the x-axis. The final layout should look like the one below:\r\n\r\n5.5.3 Enhancing the Dashboard\r\nTo further enhance the dashboard to make it more intuitive for readers, we could include the graphical image of the countries. To do so:\r\nClick on Floating at the objects pane\r\nDouble Click on Image\r\nChoose the Image and click on ‘OK’\r\nTo adjust the size of the image, on layout and adjust the size. We will use 30 pixels by 30 pixels\r\nAdjust the location of the image that would allow the image to represent the country on the graph\r\nThe layout should look like this:\r\n\r\nRepeat the above steps to add the image for Malaysia. To ensure that the images are aligned and has consistent spacing between the images, it is important to use the Position X and Y for the image alignment. To do so:\r\nSet the X Position to 155 pixel\r\nSet the Y Position to increase by 35 pixels each time.\r\n\r\nRepeat the steps to include the images for the rest of the graphs.\r\n6. New Insights from the Improved Visualisation\r\n6.1 China - Singapore’s Top Importer and Exporter Country\r\nIn 2019 and 2020, China is Singapore’s top importer and exporter country, accounting for SGD137Bn and SGD136Bn of goods for 2019 and 2020 respectively.\r\n6.2 Hong Kong - Low Import Value, High Export Value\r\nIn 2019 and 2020, while Hong Kong’s imports are under SGD1Bn for most of the months, Singapore exported more than SGD4Bn worth of goods to Hong Kong monthly. Hong Kong is Singapore’s 2nd largest exporter country. The surge in exports to Hong Kong could be due to transshipment where Hong Kong is a port hub, connected to the rest of the world.\r\n6.3 China’s Total Trade with Singapore = Hong Kong’s Total Trade + Taiwan’s Total Trade\r\nIn 2019 and 2020, China’s total trade value with Singapore reached about SGD273Bn. The trade value is almost equivalent to Hong Kong’s trade value (SGD133Bn) and Taiwan’s trade value (SGD141Bn).\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-29T22:06:52+08:00",
    "input_file": {}
  }
]
